Revit 2027 API
gbXMLOpeningType Enumeration
 This enumeration corresponds to the openingType attribute in gbXML and identifies the type of opening defined.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum gbXMLOpeningType
Public Enumeration gbXMLOpeningType
public enum class gbXMLOpeningType
type gbXMLOpeningType
Members
Member name | Value | Description
FixedSkylight | 2 |  Fixed skylight.
FixedWindow | 0 |  Fixed window.
NonSlidingDoor | 5 |  Non sliding door.
NoOfOpeningTypes | 7 |  No of opening types.
OpeningAir | 6 |  Opening air.
OperableSkylight | 3 |  Operable skylight.
OperableWindow | 1 |  Operable window.
SlidingDoor | 4 |  Sliding door.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace